lab11/nrf5x-base/sdk/nrf5_sdk_15.2.0_thread/components/benchmark/thread/thread_benchmark.c
/**
 * Copyright (c) 2018, Nordic Semiconductor ASA
 *
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */

#include "app_timer.h"
#include "test_transmission.h"
#include "benchmark_api.h"
#include "cpu_utilization.h"
#include "thread_utils.h"

#include "boards.h"
#include "nrf_log.h"

#include <openthread/coap.h>
#include <openthread/ip6.h>
#include <openthread/platform/alarm-milli.h>
#include <openthread/thread.h>

APP_TIMER_DEF(m_discovery_timer);

struct benchmark_address_context_t
{
    otIp6Address addr;
};

typedef enum
{
    TEST_START_REQUEST = 0, /**< Notify the receiver that we want to start the test. */
    TEST_STOP_REQUEST,      /**< Notify the receiver that we want to stop the test. */
} benchmark_ctrl_t;

typedef struct
{
    otCoapResource discovery_resource; /**< CoAP discovery resource. */
    otCoapResource test_ctrl_resource; /**< CoAP test control resource. */
    otCoapResource results_resource;   /**< CoAP results resource */
} thread_benchmark_resources_t;

typedef struct
{
    otIp6Address addr;
    uint64_t     device_id;
} thread_benchmark_peer_entry_t;

static uint32_t                      m_start_time;
static benchmark_evt_t               m_benchmark_evt;
static benchmark_result_t            m_local_result;
static benchmark_result_t            m_remote_result;
static benchmark_callback_t          mp_callback;
static benchmark_peer_db_t           m_peer_information;
static benchmark_address_context_t   m_peer_addresses[BENCHMARK_MAX_PEER_NUMBER];
static benchmark_configuration_t   * mp_test_configuration;

static benchmark_status_t m_test_status =
{
    .test_in_progress   = false,
    .reset_counters     = false,
    .waiting_for_ack    = 0,
    .packets_left_count = 0,
    .acks_lost          = 0,
};

void benchmark_test_duration_calculate(void)
{
    m_local_result.duration = otPlatAlarmMilliGetNow() - m_start_time;
}

uint64_t benchmark_local_device_id_get(void)
{
    uint32_t dev_id_hi = NRF_FICR->DEVICEID[1];
    uint32_t dev_id_lo = NRF_FICR->DEVICEID[0];

    return (((uint64_t)dev_id_hi) << 32) | dev_id_lo;
}

static void result_clear(void)
{
    memset(&m_local_result, 0, sizeof(m_local_result));
    memset(&m_remote_result, 0, sizeof(m_remote_result));

    otMacCounters counters = *otLinkGetCounters(thread_ot_instance_get());

    m_local_result.rx_counters.rx_total  = counters.mRxTotal;
    m_local_result.rx_counters.rx_error  = counters.mRxErrNoFrame + counters.mRxErrFcs +
                                     counters.mRxErrSec + counters.mRxErrOther;
    cpu_utilization_clear();
}

static otError thread_benchmark_peer_discovery_response_send(void                * p_context,
                                                             const otMessageInfo * p_message_info)
{
    otError       error = OT_ERROR_NO_BUFS;
    otCoapHeader  header;
    otMessage   * p_response;
    otMessageInfo message_info;
    uint64_t      device_id;

    do
    {
        otCoapHeaderInit(&header, OT_COAP_TYPE_NON_CONFIRMABLE, OT_COAP_CODE_PUT);
        otCoapHeaderGenerateToken(&header, 2);
        UNUSED_RETURN_VALUE(otCoapHeaderAppendUriPathOptions(&header, "discovery"));
        UNUSED_RETURN_VALUE(otCoapHeaderSetPayloadMarker(&header));

        p_response = otCoapNewMessage(thread_ot_instance_get(), &header);
        if (p_response == NULL)
        {
            break;
        }

        error = otMessageAppend(
            p_response, otThreadGetMeshLocalEid(thread_ot_instance_get()), sizeof(otIp6Address));
        if (error != OT_ERROR_NONE)
        {
            break;
        }

        device_id = benchmark_local_device_id_get();
        error = otMessageAppend(p_response, &device_id, sizeof(device_id));
        if (error != OT_ERROR_NONE)
        {
            break;
        }

        memset(&message_info, 0, sizeof(message_info));

        message_info.mPeerAddr    = p_message_info->mPeerAddr;
        message_info.mPeerPort    = p_message_info->mPeerPort;
        message_info.mInterfaceId = OT_NETIF_INTERFACE_ID_THREAD;

        error = otCoapSendResponse(p_context, p_response, &message_info);

    } while (false);

