lab11/nrf5x-base/sdk/nrf5_sdk_15.2.0_thread/components/benchmark/thread/thread_benchmark.c
    if (error != OT_ERROR_NONE && p_response != NULL)
    {
        otMessageFree(p_response);
    }

    return error;
}

static void thread_benchmark_peer_discovery_response_handler(void                * p_context,
                                                             otCoapHeader        * p_header,
                                                             otMessage           * p_message,
                                                             const otMessageInfo * p_message_info)
{
    UNUSED_VARIABLE(p_context);
    UNUSED_VARIABLE(p_header);
    UNUSED_VARIABLE(p_message_info);

    thread_benchmark_peer_entry_t peer;
    uint16_t                      peer_number = m_peer_information.peer_count;
    uint8_t                       num_of_bytes_to_read = sizeof(peer);

    if (peer_number >= BENCHMARK_MAX_PEER_NUMBER)
    {
        NRF_LOG_INFO("Can't add peer to the list, list full");
        return;
    }

    NRF_LOG_INFO("Adding peer: %d", peer_number);

    int bytes_read = otMessageRead(p_message,
                                   otMessageGetOffset(p_message),
                                   &peer,
                                   num_of_bytes_to_read);

    m_peer_information.peer_table[peer_number].device_id = peer.device_id;
    m_peer_information.peer_table[peer_number].p_address = &m_peer_addresses[peer_number];

    memcpy(m_peer_information.peer_table[peer_number].p_address, &peer.addr, sizeof(otIp6Address));

    m_peer_information.peer_count++;

    if (bytes_read != num_of_bytes_to_read)
    {
        NRF_LOG_ERROR("Invalid discovery response read");
    }
}

static void thread_benchmark_peer_discovery_handler(void                * p_context,
                                                    otCoapHeader        * p_header,
                                                    otMessage           * p_message,
                                                    const otMessageInfo * p_message_info)
{
    UNUSED_VARIABLE(p_header);

    // Information returning from the peer.
    if (otCoapHeaderGetType(p_header) == OT_COAP_TYPE_NON_CONFIRMABLE)
    {
        if (otCoapHeaderGetCode(p_header) == OT_COAP_CODE_PUT)
        {
            thread_benchmark_peer_discovery_response_handler(p_context, p_header, p_message, p_message_info);
        }

        // Information request to be processed on peer.
        if (otCoapHeaderGetCode(p_header) == OT_COAP_CODE_GET)
        {
            otError err = thread_benchmark_peer_discovery_response_send(p_context, p_message_info);

            if (err == OT_ERROR_NONE)
            {
                NRF_LOG_INFO("Discovery response sent");
            }
        }
    }
}

static otError thread_benchmark_ctrl_response_send(void                * p_context,
                                                   otCoapHeader        * p_request_header,
                                                   const otMessageInfo * p_message_info,
                                                   benchmark_ctrl_t      cmd)
{
    otError      error = OT_ERROR_NO_BUFS;
    otCoapHeader header;
    otMessage  * p_response;

    do
    {
        otCoapHeaderInit(&header, OT_COAP_TYPE_NON_CONFIRMABLE, OT_COAP_CODE_CONTENT);
        otCoapHeaderSetToken(&header,
                             otCoapHeaderGetToken(p_request_header),
                             otCoapHeaderGetTokenLength(p_request_header));
        UNUSED_RETURN_VALUE(otCoapHeaderSetPayloadMarker(&header));

        p_response = otCoapNewMessage(thread_ot_instance_get(), &header);
        if (p_response == NULL)
        {
            break;
        }

        error = otMessageAppend(p_response, &cmd, sizeof(benchmark_ctrl_t));
        if (error != OT_ERROR_NONE)
        {
            break;
        }

        error = otCoapSendResponse(thread_ot_instance_get(), p_response, p_message_info);
    } while (false);

    if (error != OT_ERROR_NONE && p_response != NULL)
    {
        otMessageFree(p_response);
    }

    return error;
}

static void frame_counters_calculate(void)
{
    otMacCounters counters = *otLinkGetCounters(thread_ot_instance_get());

    uint32_t rx_total = counters.mRxTotal;
    uint32_t rx_error = counters.mRxErrNoFrame + counters.mRxErrFcs +
                        counters.mRxErrSec + counters.mRxErrOther;

    m_local_result.rx_counters.rx_total  = rx_total - m_local_result.rx_counters.rx_total;
    m_local_result.rx_counters.rx_error  = rx_error - m_local_result.rx_counters.rx_error;
}

static otError thread_benchmark_results_response_send(void                * p_context,
                                                      otCoapHeader        * p_request_header,
                                                      const otMessageInfo * p_message_info)
{
    otError      error = OT_ERROR_NO_BUFS;
    otCoapHeader header;
    otMessage  * p_response;

    do
    {
        otCoapHeaderInit(&header, OT_COAP_TYPE_NON_CONFIRMABLE, OT_COAP_CODE_CONTENT);
        otCoapHeaderSetToken(&header,
                             otCoapHeaderGetToken(p_request_header),
                             otCoapHeaderGetTokenLength(p_request_header));
        UNUSED_RETURN_VALUE(otCoapHeaderSetPayloadMarker(&header));

        p_response = otCoapNewMessage(thread_ot_instance_get(), &header);
        if (p_response == NULL)
        {
            break;
        }

        error = otMessageAppend(p_response, &m_local_result.rx_counters, sizeof(m_local_result.rx_counters));
        if (error != OT_ERROR_NONE)
        {
            break;
        }

        error = otMessageAppend(p_response, &m_local_result.cpu_utilization, sizeof(m_local_result.cpu_utilization));
        if (error != OT_ERROR_NONE)
        {
            break;
        }

        error = otCoapSendResponse(thread_ot_instance_get(), p_response, p_message_info);
    } while (false);

