lab11/nrf5x-base/sdk/nrf5_sdk_15.2.0_thread/components/benchmark/thread/thread_benchmark.c
    if (error != OT_ERROR_NONE && p_response != NULL)
    {
        otMessageFree(p_response);
    }

    return error;
}

static void thread_benchmark_test_start_master(void)
{
    NRF_LOG_INFO("Peer received test start command, starting test");
    result_clear();
    m_start_time = otPlatAlarmMilliGetNow();
    UNUSED_RETURN_VALUE(cpu_utilization_start());

    m_test_status.test_in_progress = true;
    m_test_status.acks_lost        = 0;

    m_benchmark_evt.evt           = BENCHMARK_TEST_STARTED;
    m_benchmark_evt.context.error = OT_ERROR_NONE;

    mp_callback(&m_benchmark_evt);
}

static void thread_benchmark_test_stop_master(void)
{
    otError error = OT_ERROR_NONE;

    NRF_LOG_INFO("Peer received test stop command, requesting results")
    UNUSED_RETURN_VALUE(cpu_utilization_stop());
    m_local_result.cpu_utilization = cpu_utilization_get();

    if (mp_test_configuration == NULL)
    {
        return;
    }

    if (mp_test_configuration->peer_control)
    {
        error = (otError)benchmark_peer_results_request_send();
        m_benchmark_evt.evt           = BENCHMARK_TEST_STOPPED;
        m_benchmark_evt.context.error = error;
    }
    else
    {
        frame_counters_calculate();

        m_benchmark_evt.evt                             = BENCHMARK_TEST_COMPLETED;
        m_benchmark_evt.context.results.p_remote_result = NULL;
        m_benchmark_evt.context.results.p_local_result  = &m_local_result;
        m_benchmark_evt.context.results.p_local_status  = &m_test_status;
    }

    mp_callback(&m_benchmark_evt);
}

static void thread_benchmark_test_start_slave(void)
{
    NRF_LOG_INFO("Test start command received (slave)");
    result_clear();
    m_start_time = otPlatAlarmMilliGetNow();
    UNUSED_RETURN_VALUE(cpu_utilization_start());
}

static void thread_benchmark_test_stop_slave(void)
{
    NRF_LOG_INFO("Test stop command received (slave)");
    frame_counters_calculate();
    UNUSED_RETURN_VALUE(cpu_utilization_stop());

    benchmark_test_duration_calculate();

    if ((mp_test_configuration) && (mp_test_configuration->peer_control == false))
    {
        m_benchmark_evt.evt                             = BENCHMARK_TEST_COMPLETED;
        m_benchmark_evt.context.results.p_remote_result = NULL;
        m_benchmark_evt.context.results.p_local_result  = &m_local_result;
        m_benchmark_evt.context.results.p_local_status  = &m_test_status;
        mp_callback(&m_benchmark_evt);
    }
    else
    {
        m_local_result.cpu_utilization = cpu_utilization_get();
    }
}

static void thread_benchmark_ctrl_handler(void                * p_context,
                                          otCoapHeader        * p_header,
                                          otMessage           * p_message,
                                          const otMessageInfo * p_message_info)
{
    benchmark_ctrl_t cmd;

    if ((otCoapHeaderGetType(p_header) == OT_COAP_TYPE_CONFIRMABLE) &&
        (otCoapHeaderGetCode(p_header) == OT_COAP_CODE_GET))
    {
        int bytes_read = otMessageRead(p_message, otMessageGetOffset(p_message), &cmd, sizeof(benchmark_ctrl_t));

        if (bytes_read != sizeof(benchmark_ctrl_t))
        {
            NRF_LOG_ERROR("Invalid test ctrl message read");
        }

        switch (cmd)
        {
            case TEST_START_REQUEST:
                thread_benchmark_test_start_slave();
                UNUSED_RETURN_VALUE(thread_benchmark_ctrl_response_send(p_context, p_header, p_message_info, cmd));
                break;

            case TEST_STOP_REQUEST:
                thread_benchmark_test_stop_slave();
                UNUSED_RETURN_VALUE(thread_benchmark_ctrl_response_send(p_context, p_header, p_message_info, cmd));
                break;

            default:
                NRF_LOG_ERROR("Unknown Test ctrl command received%d", cmd);
                break;
        }
    }
}

static void thread_benchmark_results_handler(void                * p_context,
                                             otCoapHeader        * p_header,
                                             otMessage           * p_message,
                                             const otMessageInfo * p_message_info)
{
    UNUSED_VARIABLE(p_context);
    UNUSED_VARIABLE(p_header);
    UNUSED_VARIABLE(p_message);
    UNUSED_VARIABLE(p_message_info);

    if ((otCoapHeaderGetType(p_header) == OT_COAP_TYPE_CONFIRMABLE) &&
        (otCoapHeaderGetCode(p_header) == OT_COAP_CODE_GET))
    {
        NRF_LOG_INFO("Results request received");
        UNUSED_RETURN_VALUE(thread_benchmark_results_response_send(p_context, p_header, p_message_info));
    }
}

static thread_benchmark_resources_t m_thread_benchmark_resources = {
    .discovery_resource = {"discovery", thread_benchmark_peer_discovery_handler, NULL, NULL},
    .test_ctrl_resource = {"test_ctrl", thread_benchmark_ctrl_handler, NULL, NULL},
    .results_resource   = {"results", thread_benchmark_results_handler, NULL, NULL},
};

/**@brief   Function for discovering peers that can be used during the test. */
static otError thread_benchmark_peer_discovery_request_send(otInstance * p_instance)
{
    otError       error = OT_ERROR_NO_BUFS;
    otCoapHeader  header;
    otMessage   * p_request;
    otMessageInfo message_info;

    do
    {
        otCoapHeaderInit(&header, OT_COAP_TYPE_NON_CONFIRMABLE, OT_COAP_CODE_GET);
        otCoapHeaderGenerateToken(&header, 2);

        error = otCoapHeaderAppendUriPathOptions(&header, "discovery");
        ASSERT(error == OT_ERROR_NONE);

        p_request = otCoapNewMessage(p_instance, &header);
        if (p_request == NULL)
        {
            break;
        }

        memset(&message_info, 0, sizeof(message_info));
        message_info.mInterfaceId = OT_NETIF_INTERFACE_ID_THREAD;
        message_info.mPeerPort    = OT_DEFAULT_COAP_PORT;

