lab11/nrf5x-base/sdk/nrf5_sdk_15.2.0_thread/components/benchmark/thread/thread_benchmark.c
        error = otIp6AddressFromString("FF03::1", &message_info.mPeerAddr);
        ASSERT(error == OT_ERROR_NONE);

        error = otCoapSendRequest(
            p_instance, p_request, &message_info, NULL, p_instance);

        if (error != OT_ERROR_NONE)
        {
            break;
        }

    } while (false);

    if (error != OT_ERROR_NONE && p_request != NULL)
    {
        otMessageFree(p_request);
    }

    return error;
}

static void results_received(void                * p_context,
                             otCoapHeader        * p_header,
                             otMessage           * p_message,
                             const otMessageInfo * p_message_info,
                             otError               error)
{
    UNUSED_PARAMETER(p_context);
    UNUSED_PARAMETER(p_message_info);
    UNUSED_PARAMETER(error);

    int offset;

    // Response to the send results command.
    if ((otCoapHeaderGetType(p_header) == OT_COAP_TYPE_NON_CONFIRMABLE &&
        (otCoapHeaderGetCode(p_header) == OT_COAP_CODE_CONTENT)))
    {
        NRF_LOG_INFO("Results received");

        offset = otMessageGetOffset(p_message);

        int bytes_read = otMessageRead(p_message, offset, &m_remote_result.rx_counters, sizeof(m_remote_result.rx_counters));

        if (bytes_read != sizeof(m_remote_result.rx_counters))
        {
            NRF_LOG_ERROR("Invalid rx_counters response received");
        }
        else
        {
            offset += bytes_read;
        }

        bytes_read = otMessageRead(p_message, offset, &m_remote_result.cpu_utilization, sizeof(m_remote_result.cpu_utilization));

        if (bytes_read != sizeof(m_remote_result.cpu_utilization))
        {
            NRF_LOG_ERROR("Invalid cpu_utilization response received");
        }

        frame_counters_calculate();

        m_benchmark_evt.evt                             = BENCHMARK_TEST_COMPLETED;
        m_benchmark_evt.context.results.p_remote_result = &m_remote_result;
        m_benchmark_evt.context.results.p_local_result  = &m_local_result;
        m_benchmark_evt.context.results.p_local_status  = &m_test_status;
        mp_callback(&m_benchmark_evt);
    }
}

/**@brief   Function sending test results request. */
static otError thread_benchmark_peer_results_request_send(otInstance * p_instance)
{
    otError       error = OT_ERROR_NO_BUFS;
    otCoapHeader  header;
    otMessage   * p_request;
    otMessageInfo message_info;
    NRF_LOG_INFO("Sending test results request");

    do
    {
        otCoapHeaderInit(&header, OT_COAP_TYPE_CONFIRMABLE, OT_COAP_CODE_GET);
        otCoapHeaderGenerateToken(&header, 2);

        error = otCoapHeaderAppendUriPathOptions(&header, "results");
        ASSERT(error == OT_ERROR_NONE);

        p_request = otCoapNewMessage(p_instance, &header);
        if (p_request == NULL)
        {
            break;
        }

        memset(&message_info, 0, sizeof(message_info));
        message_info.mInterfaceId = OT_NETIF_INTERFACE_ID_THREAD;
        message_info.mPeerPort    = OT_DEFAULT_COAP_PORT;
        message_info.mPeerAddr    = m_peer_information.peer_table[m_peer_information.selected_peer].p_address->addr;

        error = otCoapSendRequest(p_instance, p_request, &message_info, results_received, p_instance);

    } while (false);

    if (error != OT_ERROR_NONE && p_request != NULL)
    {
        otMessageFree(p_request);
    }

    return error;
}

static void command_response_received_handler(void                * p_context,
                                              otCoapHeader        * p_header,
                                              otMessage           * p_message,
                                              const otMessageInfo * p_message_info,
                                              otError               error)
{
    UNUSED_PARAMETER(p_context);
    UNUSED_PARAMETER(p_message_info);

    benchmark_ctrl_t cmd;

    // Response to the test start/stop command.
    if (((otCoapHeaderGetType(p_header) == OT_COAP_TYPE_NON_CONFIRMABLE) &&
        (otCoapHeaderGetCode(p_header) == OT_COAP_CODE_CONTENT)))
    {
        int bytes_read = otMessageRead(p_message, otMessageGetOffset(p_message), &cmd, sizeof(benchmark_ctrl_t));

        if (bytes_read != sizeof(benchmark_ctrl_t))
        {
            NRF_LOG_ERROR("Invalid peer test command response read");
        }

        switch (cmd)
        {
            case TEST_START_REQUEST:
                thread_benchmark_test_start_master();
                break;

            case TEST_STOP_REQUEST:
                thread_benchmark_test_stop_master();
                break;

            default:
                NRF_LOG_INFO("Incorrect peer command response received: %d", cmd);
                break;
        }
    }
}

/**@brief   Function sending start/stop test request. */
static otError thread_benchmark_ctrl_request_send(otInstance * p_instance, benchmark_ctrl_t ctrl_cmd)
{
    otError       error = OT_ERROR_NO_BUFS;
    otCoapHeader  header;
    otMessage   * p_request;
    otMessageInfo message_info;

    do
    {
        otCoapHeaderInit(&header, OT_COAP_TYPE_CONFIRMABLE, OT_COAP_CODE_GET);
        otCoapHeaderGenerateToken(&header, 2);

        error = otCoapHeaderAppendUriPathOptions(&header, "test_ctrl");
        ASSERT(error == OT_ERROR_NONE);

        error = otCoapHeaderSetPayloadMarker(&header);
        ASSERT(error == OT_ERROR_NONE);

        p_request = otCoapNewMessage(p_instance, &header);
        if (p_request == NULL)
        {
            break;
        }

        memset(&message_info, 0, sizeof(message_info));
        message_info.mInterfaceId = OT_NETIF_INTERFACE_ID_THREAD;
        message_info.mPeerPort    = OT_DEFAULT_COAP_PORT;
        message_info.mPeerAddr    = m_peer_information.peer_table[m_peer_information.selected_peer].p_address->addr;

        error = otMessageAppend(p_request, &ctrl_cmd, sizeof(benchmark_ctrl_t));

        if (error != OT_ERROR_NONE)
        {
            break;
        }

        error = otCoapSendRequest(p_instance, p_request, &message_info, command_response_received_handler, p_instance);

    } while (false);

