lab11/nrf5x-base/sdk/nrf5_sdk_15.2.0_thread/components/benchmark/thread/thread_benchmark.c
    if (error != OT_ERROR_NONE && p_request != NULL)
    {
        otMessageFree(p_request);
    }

    return error;
}

static void discovery_timeout(void * p_context)
{
    UNUSED_PARAMETER(p_context);
    m_benchmark_evt.evt                        = BENCHMARK_DISCOVERY_COMPLETED;
    m_benchmark_evt.context.p_peer_information = &m_peer_information;
    mp_callback(&m_benchmark_evt);
}

/**@brief   Function for initializing the CoAP resources used for test management. */
void benchmark_init(void)
{
    test_transmission_init();

    m_thread_benchmark_resources.test_ctrl_resource.mContext = thread_ot_instance_get();
    m_thread_benchmark_resources.discovery_resource.mContext = thread_ot_instance_get();
    m_thread_benchmark_resources.results_resource.mContext   = thread_ot_instance_get();

    mp_test_configuration = NULL;

    otError error = otCoapAddResource(thread_ot_instance_get(), &m_thread_benchmark_resources.test_ctrl_resource);
    ASSERT(error == OT_ERROR_NONE);

    error = otCoapAddResource(thread_ot_instance_get(), &m_thread_benchmark_resources.discovery_resource);
    ASSERT(error == OT_ERROR_NONE);

    error = otCoapAddResource(thread_ot_instance_get(), &m_thread_benchmark_resources.results_resource);
    ASSERT(error == OT_ERROR_NONE);

    uint32_t err_code = app_timer_create(&m_discovery_timer, APP_TIMER_MODE_SINGLE_SHOT, discovery_timeout);
    ASSERT(err_code == NRF_SUCCESS);
}

uint32_t benchmark_test_init(benchmark_configuration_t * p_configuration, benchmark_callback_t callback)
{
    mp_callback                      = callback;
    mp_test_configuration            = p_configuration;
    m_test_status.frame_number       = 1;
    m_test_status.packets_left_count = p_configuration->count;

    return OT_ERROR_NONE;
}

uint32_t benchmark_peer_discover(void)
{
    memset(&m_peer_information, 0, sizeof(m_peer_information));

    otError error = thread_benchmark_peer_discovery_request_send(thread_ot_instance_get());

    uint32_t err_code = app_timer_start(m_discovery_timer, APP_TIMER_TICKS(BENCHMARK_DISCOVERY_TIMEOUT), NULL);
    ASSERT(err_code == NRF_SUCCESS);

    return (uint32_t)error;
}

const benchmark_peer_db_t * benchmark_peer_table_get(void)
{
    return &m_peer_information;
}

benchmark_status_t * benchmark_status_get(void)
{
    return &m_test_status;
}

uint32_t benchmark_test_start(void)
{
    uint32_t err_code = OT_ERROR_NONE;

    if (mp_test_configuration == NULL)
    {
        return OT_ERROR_INVALID_ARGS;
    }

    memset(&m_benchmark_evt, 0, sizeof(benchmark_evt_t));

    if (mp_test_configuration->role == BENCHMARK_ROLE_SLAVE)
    {
        if (mp_test_configuration->peer_control == false)
        {
            m_test_status.reset_counters = true;
            thread_benchmark_test_start_slave();
        }
        return err_code;
    }
    m_test_status.reset_counters = false;

    /* If peer control is disabled, do not send a request to start the test on the other side. */
    if (!mp_test_configuration->peer_control)
    {
        thread_benchmark_test_start_master();
        return err_code;
    }

    err_code = (uint32_t)thread_benchmark_ctrl_request_send(thread_ot_instance_get(), TEST_START_REQUEST);
    return err_code;
}

uint32_t benchmark_test_stop(void)
{
    uint32_t err_code = OT_ERROR_NONE;

    if (mp_test_configuration == NULL)
    {
        return OT_ERROR_INVALID_ARGS;
    }

    m_test_status.test_in_progress = false;

    benchmark_test_duration_calculate();

    if (mp_test_configuration->role == BENCHMARK_ROLE_SLAVE)
    {
        if (mp_test_configuration->peer_control == false)
        {
            thread_benchmark_test_stop_slave();
        }
        return err_code;
    }

    /* If peer control is disabled, do not send a request to start the test on the other side. */
    if (!mp_test_configuration->peer_control)
    {
        thread_benchmark_test_stop_master();
        return err_code;
    }

    err_code = (uint32_t)thread_benchmark_ctrl_request_send(thread_ot_instance_get(), TEST_STOP_REQUEST);
    return err_code;
}


uint32_t benchmark_peer_results_request_send(void)
{
    return (uint32_t)thread_benchmark_peer_results_request_send(thread_ot_instance_get());
}

void benchmark_process(void)
{
    benchmark_test_state_t status = TEST_IDLE;

    if (mp_test_configuration == NULL)
    {
        return;
    }

    if (m_test_status.test_in_progress && m_test_status.packets_left_count)
    {
        status = test_transmission_packet_transmit(mp_test_configuration, &m_test_status);

        switch (status)
        {
        // fall through
        case TEST_IN_PROGRESS_WAITING_FOR_ACK:
        case TEST_IN_PROGRESS_WAITING_FOR_TX_BUFFER:
        case TEST_IDLE:
            break;

        case TEST_IN_PROGRESS_FRAME_SENT:
            NRF_LOG_DEBUG("Test frame sent");
            m_test_status.packets_left_count--;
            break;

        case TEST_IN_PROGRESS_FRAME_SENT_WAITING_FOR_ACK:
            NRF_LOG_DEBUG("Test frame sent, waiting for ACK");
            m_test_status.packets_left_count--;
            break;

        case TEST_ERROR:
            NRF_LOG_ERROR("Error occurred during the test transmission: %d\r\n Sent %d packets",
                          status,
                          (mp_test_configuration->count - m_test_status.packets_left_count));
            break;

        default:
            ASSERT(false);
            break;
        }
    }
    else if(m_test_status.test_in_progress)
    {
        benchmark_test_duration_calculate();
        m_test_status.test_in_progress = false;

        if (mp_test_configuration->peer_control)
        {
            NRF_LOG_INFO("All frames sent, sending test stop request to the peer");
            uint32_t err_code = thread_benchmark_ctrl_request_send(thread_ot_instance_get(), TEST_STOP_REQUEST);
            ASSERT(err_code == NRF_SUCCESS);
        }
        else
        {
            thread_benchmark_test_stop_master();
        }

    }
}

benchmark_result_t * benchmark_local_result_get(void)
{
    return &m_local_result;
}
